article/flash-sale-system.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-06 Fri 16:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>秒杀系统设计</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">秒杀系统设计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge133df6">1. 基本参数</a></li>
<li><a href="#org1f5ee7d">2. 架构设计</a></li>
<li><a href="#org2897471">3. 数据库设计</a>
<ul>
<li><a href="#orga2f9f1e">3.1. 秒杀活动表 activity</a></li>
<li><a href="#org8c0b887">3.2. 库存表 stock</a></li>
<li><a href="#orgcab1d21">3.3. 商品表 product</a></li>
</ul>
</li>
<li><a href="#orgb9952c0">4. MySQL 实现扣减库存的途径</a>
<ul>
<li><a href="#org31e9ae1">4.1. 悲观锁 Pessimistic Lock</a></li>
<li><a href="#org6c709b2">4.2. 乐观锁 Optimistic Lock</a></li>
</ul>
</li>
<li><a href="#org4d31fb7">5. Redis 实现扣减库存的途径</a></li>
<li><a href="#orgcc3d5db">6. 数据一致性的讨论</a></li>
<li><a href="#orgf0c65ea">7. 常见处理问题</a>
<ul>
<li><a href="#org7549120">7.1. 倒计时实现方式</a></li>
<li><a href="#org56172c3">7.2. 下单和减库存的细节</a></li>
<li><a href="#orgb38d31d">7.3. 如何防止超卖</a></li>
<li><a href="#orgc03e6ee">7.4. 库存写回数据库时机</a></li>
<li><a href="#orgeee63aa">7.5. 双十一刷爆页面的处理策略</a></li>
<li><a href="#orga1fa200">7.6. 增对爬虫和黄牛处理</a></li>
<li><a href="#org7463994">7.7. 如果秒杀服务挂了，如果不影响正常服务</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orge133df6" class="outline-2">
<h2 id="orge133df6"><span class="section-number-2">1</span> 基本参数</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>需求设计一个可以承载 100W QPS 的秒杀系统</li>
<li>考虑到 MySQL 的最大 QPS = 1000</li>
<li>考虑到 Redis 的最大 QPS = 10W</li>
</ol>
</div>
</div>

<div id="outline-container-org1f5ee7d" class="outline-2">
<h2 id="org1f5ee7d"><span class="section-number-2">2</span> 架构设计</h2>
<div class="outline-text-2" id="text-2">
<p>
在描述活动中涉及到多个微服务的
</p>
<ol class="org-ol">
<li>ActivityService 活动微服务</li>
<li>ProductService 产品微服务</li>
<li>OrderService 订单微服务</li>
<li>PaymentService 支付微服务</li>
</ol>
<div class="org-src-container">
<pre class="src src-text">[App] ----&gt; ActivityService  --&gt; DB1
       |
       +--&gt; ProductService   --&gt; DB2
       |
       +--&gt; OrderService     --&gt; DB3
       |
       +--&gt; PaymentService   --&gt; DB4
</pre>
</div>
</div>
</div>

<div id="outline-container-org2897471" class="outline-2">
<h2 id="org2897471"><span class="section-number-2">3</span> 数据库设计</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga2f9f1e" class="outline-3">
<h3 id="orga2f9f1e"><span class="section-number-3">3.1</span> 秒杀活动表 activity</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">create</span> <span style="color: #4f97d7; font-weight: bold;">table</span> <span style="color: #bc6ec5; font-weight: bold;">activity</span> (
  id bigint <span style="color: #4f97d7; font-weight: bold;">primary</span> <span style="color: #4f97d7; font-weight: bold;">key</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span> auto_increment,
  activity_code <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">unique</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  activity_name <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  activity_type <span style="color: #ce537a; font-weight: bold;">varchar</span>(8) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  product_code <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  activity_price <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  activity_count <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>
);
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">活动编码</th>
<th scope="col" class="org-left">活动名称</th>
<th scope="col" class="org-left">活动类型</th>
<th scope="col" class="org-left">商品编码</th>
<th scope="col" class="org-right">活动价格</th>
<th scope="col" class="org-right">活动数量</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">H10001</td>
<td class="org-left">iPhone 2021 秒杀</td>
<td class="org-left">秒杀</td>
<td class="org-left">T0001</td>
<td class="org-right">4499</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">H10002</td>
<td class="org-left">iPhone 2021 下单增 1000 元优惠卷</td>
<td class="org-left">买赠</td>
<td class="org-left">T0001</td>
<td class="org-right">4999</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8c0b887" class="outline-3">
<h3 id="org8c0b887"><span class="section-number-3">3.2</span> 库存表 stock</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">create</span> <span style="color: #4f97d7; font-weight: bold;">table</span> <span style="color: #bc6ec5; font-weight: bold;">stock</span> (
  id bigint <span style="color: #4f97d7; font-weight: bold;">primary</span> <span style="color: #4f97d7; font-weight: bold;">key</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span> auto_increment,
  product_code <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">unique</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  product_name <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  activity_code <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  stock_count <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  occupy_count <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">default</span> 0 <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  version <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">default</span> 0
);
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">商品编码</th>
<th scope="col" class="org-left">商品名称</th>
<th scope="col" class="org-left">活动编码</th>
<th scope="col" class="org-right">总库存数</th>
<th scope="col" class="org-right">预占库存数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T0001</td>
<td class="org-left">iPhone 12</td>
<td class="org-left">H10001</td>
<td class="org-right">10</td>
<td class="org-right">2</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgcab1d21" class="outline-3">
<h3 id="orgcab1d21"><span class="section-number-3">3.3</span> 商品表 product</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #4f97d7; font-weight: bold;">create</span> <span style="color: #4f97d7; font-weight: bold;">table</span> <span style="color: #bc6ec5; font-weight: bold;">product</span> (
  id bigint <span style="color: #4f97d7; font-weight: bold;">primary</span> <span style="color: #4f97d7; font-weight: bold;">key</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span> auto_increment,
  product_code <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">unique</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  product_name <span style="color: #ce537a; font-weight: bold;">varchar</span>(64) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  product_title <span style="color: #ce537a; font-weight: bold;">varchar</span>(128) <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>,
  product_desc text,
  product_price <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">not</span> <span style="color: #4f97d7; font-weight: bold;">null</span>
);
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">商品编码</th>
<th scope="col" class="org-left">商品名称</th>
<th scope="col" class="org-left">商品标题</th>
<th scope="col" class="org-right">商品原价</th>
<th scope="col" class="org-left">商品描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">T0001</td>
<td class="org-left">iPhone 12</td>
<td class="org-left">Apple iPhone 12 128GB 白色 移动联通电信 4G 手机</td>
<td class="org-right">5599</td>
<td class="org-left">xxxx</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgb9952c0" class="outline-2">
<h2 id="orgb9952c0"><span class="section-number-2">4</span> MySQL 实现扣减库存的途径</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org31e9ae1" class="outline-3">
<h3 id="org31e9ae1"><span class="section-number-3">4.1</span> 悲观锁 Pessimistic Lock</h3>
<div class="outline-text-3" id="text-4-1">
<p>
在 MySQL 的实现方法, 利用 <code>for update</code> 的行锁机制来并发竞争库存
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #2aa1ae; background-color: #292e34;">-- &#31532;&#19968;&#27493;: &#26597;&#35810;&#24182;&#38145;&#34920;</span>
<span style="color: #4f97d7; font-weight: bold;">select</span> *
  <span style="color: #4f97d7; font-weight: bold;">from</span> stock
 <span style="color: #4f97d7; font-weight: bold;">where</span> product_id = ??? <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #4f97d7; font-weight: bold;">update</span>;

<span style="color: #2aa1ae; background-color: #292e34;">-- &#31532;&#20108;&#27493;: &#25187;&#24211;&#23384;</span>
<span style="color: #4f97d7; font-weight: bold;">update</span> stock
   <span style="color: #4f97d7; font-weight: bold;">set</span> stock_count = stock_count - 1
 <span style="color: #4f97d7; font-weight: bold;">where</span> product_id = ??? <span style="color: #4f97d7; font-weight: bold;">and</span> stock_count &gt; 0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c709b2" class="outline-3">
<h3 id="org6c709b2"><span class="section-number-3">4.2</span> 乐观锁 Optimistic Lock</h3>
<div class="outline-text-3" id="text-4-2">
<p>
在 MySQL 的实现方法是引入一个额外的字段，记住更新的版本号
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #2aa1ae; background-color: #292e34;">-- &#27599;&#27425;&#26597;&#35810;&#26102;&#28155;&#21152;&#29256;&#26412;&#21495;&#23383;&#27573; version, &#36825;&#31181;&#20570;&#27861;&#19981;&#20250;&#20135;&#29983;&#34892;&#38145;</span>
<span style="color: #4f97d7; font-weight: bold;">update</span> stock
   <span style="color: #4f97d7; font-weight: bold;">set</span> stock_count = stock_count - 1 <span style="color: #4f97d7; font-weight: bold;">and</span> version = version + 1
 <span style="color: #4f97d7; font-weight: bold;">where</span> product_id = ??? <span style="color: #4f97d7; font-weight: bold;">and</span> stock_count &gt; 0 <span style="color: #4f97d7; font-weight: bold;">and</span> version = ???;

<span style="color: #2aa1ae; background-color: #292e34;">-- &#22914;&#26524;&#26356;&#26032;&#22833;&#36133;, &#38656;&#35201;&#37325;&#35797;&#19968;&#19979;</span>
<span style="color: #4f97d7; font-weight: bold;">select</span> *
  <span style="color: #4f97d7; font-weight: bold;">from</span> stock
 <span style="color: #4f97d7; font-weight: bold;">where</span> product_id == ???;

<span style="color: #4f97d7; font-weight: bold;">update</span> stock
   <span style="color: #4f97d7; font-weight: bold;">set</span> stock_count = stock_count - 1 <span style="color: #4f97d7; font-weight: bold;">and</span> version = version + 1
 <span style="color: #4f97d7; font-weight: bold;">where</span> product_id = ??? <span style="color: #4f97d7; font-weight: bold;">and</span> stock_count &gt; 0 <span style="color: #4f97d7; font-weight: bold;">and</span> version = ???;
</pre>
</div>

<p>
注意：
</p>
<ol class="org-ol">
<li>在秒杀的情景下乐观锁并不能解决问题</li>
<li>高并发情景下可能会把 MySQL 数据库整崩溃</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org4d31fb7" class="outline-2">
<h2 id="org4d31fb7"><span class="section-number-2">5</span> Redis 实现扣减库存的途径</h2>
<div class="outline-text-2" id="text-5">
<p>
因为 Redis 的并发量比 MySQL 要高，可以引用 Redis 来优化库存扣减的逻辑，从而提
高系统的吞吐量
</p>

<p>
设置库存, 创建或维护时将数据写入 Redis 缓存
</p>
<div class="org-src-container">
<pre class="src src-java">redisClient.set<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"prdt_id_stock"</span>, 10<span style="color: #8d5649;">)</span>;
</pre>
</div>

<p>
扣减库存
</p>
<ol class="org-ol">
<li><p>
Lua 脚本完成原子操作
</p>
<div class="org-src-container">
<pre class="src src-lua"><span style="color: #4f97d7; font-weight: bold;">if</span> (redis.call(<span style="color: #2d9574;">'exists'</span>, KEYS[1]) == 1) <span style="color: #4f97d7; font-weight: bold;">then</span>
   <span style="color: #4f97d7; font-weight: bold;">local</span> <span style="color: #7590db;">stock</span> = <span style="color: #4f97d7;">tonumber</span>(redis.call(<span style="color: #2d9574;">'get'</span>, KEYS[1]));
   <span style="color: #4f97d7; font-weight: bold;">if</span> (stock == -1) <span style="color: #4f97d7; font-weight: bold;">then</span>
      <span style="color: #4f97d7; font-weight: bold;">return</span> 1;
   <span style="color: #4f97d7; font-weight: bold;">end</span>;
   <span style="color: #4f97d7; font-weight: bold;">if</span> (stock &gt; 0) <span style="color: #4f97d7; font-weight: bold;">then</span>
      redis.call(<span style="color: #2d9574;">'incrby'</span>, KEYS[1], -1);
      <span style="color: #4f97d7; font-weight: bold;">return</span> stock;
   <span style="color: #4f97d7; font-weight: bold;">end</span>;
   <span style="color: #4f97d7; font-weight: bold;">return</span> 0;
<span style="color: #4f97d7; font-weight: bold;">end</span>;
<span style="color: #4f97d7; font-weight: bold;">return</span> -1;
</pre>
</div></li>
<li><p>
Java API 的操作
</p>
<div class="org-src-container">
<pre class="src src-java">redisClient.decr<span style="color: #8d5649;">(</span><span style="color: #2d9574;">"prdt_id_stock"</span><span style="color: #8d5649;">)</span>;
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-orgcc3d5db" class="outline-2">
<h2 id="orgcc3d5db"><span class="section-number-2">6</span> 数据一致性的讨论</h2>
<div class="outline-text-2" id="text-6">
<p>
目前记录活动的数量出现在三个地方
</p>
<ol class="org-ol">
<li>活动表 &#x2013; 售卖数量 static</li>
<li>库存表 &#x2013; 库存数量 dynamic</li>
<li>Redis  &#x2013; 库存数量 dynamic</li>
</ol>

<p>
问题是如何保证 <code>库存表</code> 和 <code>Redis</code> 的库存数量和 <code>活动表</code> 的数量一致
</p>
<ol class="org-ol">
<li>在分布式系统中要不保证强一致性是不可能的</li>
<li>通过 BASE 理论，在互联网业务中只是要求最终一致性即可</li>
</ol>

<p>
在保证数据最终一致的方式上，这里引用了消息队列的机制，常见的消息队列包括
</p>
<ol class="org-ol">
<li>消息队列的好处是可以慢慢出来请求，不必同步处理相应结果</li>
<li>除了异步任务之外，一般还用于处理失败的情况下重试处理，重复消费直到成功</li>
<li><p>
目前主流的消息队列包括 RocketMQ, Kafka
</p>
<ul class="org-ul">
<li>一般使用 Broker 的模型, 所有的消息需要过 Broker 进行处理</li>
</ul>
<div class="org-src-container">
<pre class="src src-text">[Producer] --- send --&gt; [Broker] -- receive --&gt; [Consumer]
</pre>
</div>
<ul class="org-ul">
<li>如果 Broker 可能会重复发送, 消费者在做 API 时需要实现接口的幂等性</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgf0c65ea" class="outline-2">
<h2 id="orgf0c65ea"><span class="section-number-2">7</span> 常见处理问题</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org7549120" class="outline-3">
<h3 id="org7549120"><span class="section-number-3">7.1</span> 倒计时实现方式</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>客户单第一次获取服务端的时间</li>
<li>客户端使用本地时间进行倒计时的操作</li>
</ol>
</div>
</div>

<div id="outline-container-org56172c3" class="outline-3">
<h3 id="org56172c3"><span class="section-number-3">7.2</span> 下单和减库存的细节</h3>
<div class="outline-text-3" id="text-7-2">
<ol class="org-ol">
<li>先下单锁定库存 (需要设置超时释放库存)</li>
<li>支付减库存</li>
</ol>
</div>
</div>

<div id="outline-container-orgb38d31d" class="outline-3">
<h3 id="orgb38d31d"><span class="section-number-3">7.3</span> 如何防止超卖</h3>
<div class="outline-text-3" id="text-7-3">
<ol class="org-ol">
<li>将数据放入 Redis 的缓存中</li>
<li>利用 Redis 单线程操作，每次只能一个线程操作库存</li>
</ol>
</div>
</div>

<div id="outline-container-orgc03e6ee" class="outline-3">
<h3 id="orgc03e6ee"><span class="section-number-3">7.4</span> 库存写回数据库时机</h3>
<div class="outline-text-3" id="text-7-4">
<p>
使用定时任务, 每秒回写一下库存
</p>
</div>
</div>

<div id="outline-container-orgeee63aa" class="outline-3">
<h3 id="orgeee63aa"><span class="section-number-3">7.5</span> 双十一刷爆页面的处理策略</h3>
<div class="outline-text-3" id="text-7-5">
<ol class="org-ol">
<li>CDN 来缓存 (首推这种策略)</li>
<li>使用限流 (Rate Limiter), 页面返回系统繁忙</li>
<li>增加页面访问验证码</li>
</ol>
</div>
</div>

<div id="outline-container-orga1fa200" class="outline-3">
<h3 id="orga1fa200"><span class="section-number-3">7.6</span> 增对爬虫和黄牛处理</h3>
<div class="outline-text-3" id="text-7-6">
<ol class="org-ol">
<li>增加页面访问验证码</li>
<li>增加 IP 黑名单</li>
</ol>
</div>
</div>

<div id="outline-container-org7463994" class="outline-3">
<h3 id="org7463994"><span class="section-number-3">7.7</span> 如果秒杀服务挂了，如果不影响正常服务</h3>
<div class="outline-text-3" id="text-7-7">
<ol class="org-ol">
<li>使用熔断策略</li>
<li>Hystrix</li>
<li>Sentinel</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-08-06 Fri 16:49. Created by Jinghui Hu at 2021-08-06 Fri 12:22.</p>
</div>
</body>
</html>
